### Forest: Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
10:56:01.331 STDOUT terraform: data.external.sources_tar: Reading...
10:56:01.345 STDOUT terraform: data.external.sources_tar: Read complete after 0s [id=-]
10:56:01.348 STDOUT terraform: data.local_file.sources: Reading...
10:56:01.352 STDOUT terraform: data.local_file.sources: Read complete after 0s [id=6d521fbb6d91c2845664dab7daf66b4a8708c0f9]
10:56:01.361 STDOUT terraform: data.digitalocean_ssh_keys.keys: Reading...
10:56:01.361 STDOUT terraform: data.digitalocean_project.forest_project: Reading...
10:56:01.723 STDOUT terraform: data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/5520420071766112764]
10:56:01.727 STDOUT terraform: digitalocean_droplet.forest: Refreshing state... [id=542533077]
10:56:02.997 STDOUT terraform: data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
10:56:02.998 STDOUT terraform: digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
10:56:04.234 STDOUT terraform: Terraform used the selected providers to generate the following execution
10:56:04.234 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
10:56:04.234 STDOUT terraform:   ~ update in-place
10:56:04.235 STDOUT terraform: -/+ destroy and then create replacement
10:56:04.235 STDOUT terraform: Terraform will perform the following actions:
10:56:04.235 STDOUT terraform:   # digitalocean_droplet.forest must be replaced
10:56:04.235 STDOUT terraform: -/+ resource "digitalocean_droplet" "forest" {
10:56:04.235 STDOUT terraform:       ~ created_at           = "2026-01-07T05:27:51Z" -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ disk                 = 320 -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ id                   = "542533077" -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ ipv4_address         = "64.227.127.35" -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ ipv4_address_private = "10.135.0.18" -> (known after apply)
10:56:04.235 STDOUT terraform:       + ipv6_address         = (known after apply)
10:56:04.235 STDOUT terraform:       ~ locked               = false -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ memory               = 16384 -> (known after apply)
10:56:04.235 STDOUT terraform:         name                 = "prod-sync-check"
10:56:04.235 STDOUT terraform:       ~ price_hourly         = 0.14286 -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ price_monthly        = 96 -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ private_networking   = true -> (known after apply)
10:56:04.235 STDOUT terraform:       ~ status               = "active" -> (known after apply)
10:56:04.236 STDOUT terraform:         tags                 = [
10:56:04.236 STDOUT terraform:             "iac",
10:56:04.236 STDOUT terraform:             "prod",
10:56:04.236 STDOUT terraform:         ]
10:56:04.236 STDOUT terraform:       ~ urn                  = "do:droplet:542533077" -> (known after apply)
10:56:04.236 STDOUT terraform:       ~ user_data            = (sensitive value) # forces replacement
10:56:04.236 STDOUT terraform:       ~ vcpus                = 8 -> (known after apply)
10:56:04.236 STDOUT terraform:       ~ volume_ids           = [] -> (known after apply)
10:56:04.236 STDOUT terraform:       ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
10:56:04.236 STDOUT terraform:         # (9 unchanged attributes hidden)
10:56:04.236 STDOUT terraform:     }
10:56:04.236 STDOUT terraform:   # digitalocean_project_resources.connect_forest_project will be updated in-place
10:56:04.236 STDOUT terraform:   ~ resource "digitalocean_project_resources" "connect_forest_project" {
10:56:04.236 STDOUT terraform:         id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
10:56:04.236 STDOUT terraform:       ~ resources = [
10:56:04.236 STDOUT terraform:           - "do:droplet:542533077",
10:56:04.236 STDOUT terraform:         ] -> (known after apply)
10:56:04.236 STDOUT terraform:         # (1 unchanged attribute hidden)
10:56:04.236 STDOUT terraform:     }
10:56:04.236 STDOUT terraform: Plan: 1 to add, 1 to change, 1 to destroy.
10:56:04.236 STDOUT terraform: Changes to Outputs:
10:56:04.237 STDOUT terraform:   ~ ip = [
10:56:04.237 STDOUT terraform:       ~ "64.227.127.35" -> (known after apply),
10:56:04.237 STDOUT terraform:     ]
10:56:04.237 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
10:56:04.237 STDOUT terraform: Saved the plan to: ../../../../../../tfplan
10:56:04.237 STDOUT terraform: To perform exactly these actions, run the following command to apply:
10:56:04.237 STDOUT terraform:     terraform apply "../../../../../../tfplan"
```

</details>